{
  "projects": [
    {
      "id": "data-nexus",
      "title": "dataNexus Big Data Engineering",
      "period": "Dec 2025 - Present",
      "badge": "AI/ML",
      "badgeClass": "badge-info",
      "description": "A hands-on Big Data project showcasing how different database models and distributed computing paradigms are applied to real-world datasets, such as Amazon Food Reviews, LAPD Crime Data and arXiv publications. The repository demonstrates querying, modeling, analytics, and performance comparisons across modern big data technologies.",
      "tags": ["MongoDB", "InfluxDB", "Neo4J", "Map-reduce"],
      "url": "https://github.com/FedericoSabbadini/dataNexus",
      "featured": true
    },
    {
      "id": "f1-lstm",
      "title": "F1 Pit Strategy Predictor LSTM",
      "period": "Nov 2025 - Present",
      "badge": "AI/ML",
      "badgeClass": "badge-info",
      "description": "Built an end-to-end deep learning pipeline that predicts Formula 1 pit stop timing and tire compound selection using real-world telemetry from the FastF1 API. Achieved 0.93 AUC for pit timing prediction and 78% accuracy on compound choice using Bidirectional LSTM with self-attention mechanisms, handling time-series data across 20+ race weekends.",
      "tags": ["LSTM", "FastF1 API", "TensorFlow", "Time Series"],
      "url": "https://github.com/FedericoSabbadini/f1-strategy-predictor",
      "featured": true
    },
    {
      "id": "network-hardening",
      "title": "Network Hardening Planner",
      "period": "Nov 2025 - Present",
      "badge": "Security",
      "badgeClass": "badge-warning",
      "description": "Developed an AI-driven automated planning system that generates optimal security hardening strategies for enterprise networks. The system analyzes network topology, identifies vulnerable services and open ports, then produces actionable remediation plans that balance security improvements with operational continuity using constraint satisfaction techniques.",
      "tags": ["Python", "AI Planning", "Security", "Automation"],
      "url": "https://github.com/FedericoSabbadini/network-hardening-planner",
      "featured": false
    },
    {
      "id": "openid-thesis",
      "title": "OpenID Connect & Digital Identity",
      "period": "Jun 2024 - Oct 2024",
      "badge": "Research",
      "badgeClass": "badge-primary",
      "description": "Bachelor's thesis exploring modern identity and access management protocols. Conducted in-depth analysis of OAuth 2.0 flows, OpenID Connect authentication mechanisms, and JWT token security. Examined real-world implementations including SPID (Italian Digital Identity) and enterprise SSO solutions, with focus on security vulnerabilities and mitigation strategies.",
      "tags": ["OpenID", "OAuth 2.0", "JWT", "IAM", "Security"],
      "url": "https://drive.google.com/drive/folders/1-16jmzvplBPEBdnElmpONSHFmHeYBXk8",
      "urlLabel": "View Research",
      "featured": false
    },
    {
      "id": "talentscope",
      "title": "TalentScope AI",
      "period": "May 2025 - Jun 2025",
      "badge": "AI/ML",
      "badgeClass": "badge-info",
      "description": "Engineered a machine learning pipeline to predict FIFA 2022 player potential using ensemble methods (Random Forest, XGBoost, Gradient Boosting). Implemented advanced feature engineering on 18,000+ player records, hyperparameter tuning via GridSearchCV, and comprehensive model evaluation achieving 89% accuracy. Full MLOps workflow from data preprocessing to model deployment.",
      "tags": ["Python", "Scikit-learn", "XGBoost", "Feature Engineering"],
      "url": "https://github.com/FedericoSabbadini/TalentScope_AI",
      "featured": false
    },
    {
      "id": "oracool",
      "title": "Oracool Web Platform",
      "period": "Apr 2025 - Jul 2025",
      "badge": "SW Development",
      "badgeClass": "badge-success",
      "description": "Designed and developed a full-stack sports prediction platform following Agile/Scrum methodology. Built RESTful APIs with Laravel and Eloquent ORM, implemented user authentication with role-based access control, MySQL database with optimized queries, and responsive Bootstrap UI. Managed complete SDLC from requirements gathering to deployment.",
      "tags": ["Laravel", "PHP", "MySQL", "REST API", "Bootstrap"],
      "url": "https://github.com/FedericoSabbadini/Oracool_Project",
      "featured": false
    },
    {
      "id": "data-hiding",
      "title": "Data Hiding Research",
      "period": "Oct 2024 - Mar 2025",
      "badge": "Research",
      "badgeClass": "badge-primary",
      "description": "Research project investigating cutting-edge steganography techniques using deep learning. Analyzed CNN-based methods for embedding hidden data in images while maintaining visual imperceptibility, and GAN architectures for generating stego-images that evade statistical detection. Published comprehensive research paper comparing classical vs. neural approaches for information hiding.",
      "tags": ["Steganography", "CNN", "GAN", "PyTorch", "Research"],
      "url": "https://drive.google.com/drive/folders/1-2rBrcF9CzBdbvVcxDoxeiMTZej-5eDK",
      "urlLabel": "View Research",
      "featured": false
    },
    {
      "id": "pathfinding",
      "title": "Grid Pathfinding Algorithms",
      "period": "May 2025 - Jul 2025",
      "badge": "Opt",
      "badgeClass": "badge-danger",
      "description": "Implemented and benchmarked advanced pathfinding algorithms for obstacle-rich grid environments. Developed optimized versions of A*, Dijkstra, and JPS (Jump Point Search) with custom heuristics. Analyzed algorithmic complexity, memory usage, and runtime performance across varying grid densities, achieving up to 40% speedup over naive implementations.",
      "tags": ["Algorithms", "Graph Theory", "A*", "Optimization"],
      "url": "https://github.com/FedericoSabbadini/CamminiPRJ",
      "featured": false
    },
    {
      "id": "work-performance",
      "title": "Work Performance Trading",
      "period": "Jan 2024 - Jun 2024",
      "badge": "SW Development",
      "badgeClass": "badge-success",
      "description": "Architected a Java desktop application for automated resource exchange simulation following clean architecture principles. Implemented MVC pattern with Swing GUI, applied SOLID principles throughout, and utilized design patterns (Factory, Observer, Strategy) for extensibility. Comprehensive unit testing with JUnit and documentation following industry best practices.",
      "tags": ["Java", "Design Patterns", "MVC", "SOLID", "JUnit"],
      "url": "https://github.com/FedericoSabbadini/Software_Engineering",
      "featured": false
    },
    {
      "id": "electromagnetic",
      "title": "Electromagnetic Field Analysis",
      "period": "Apr 2024 - Jul 2024",
      "badge": "Research",
      "badgeClass": "badge-primary",
      "description": "Developed MATLAB simulation tools for quantitative assessment of electromagnetic field exposure from HF radio antennas and ELF power lines. Created 3D visualization of field intensity distributions, calculated SAR (Specific Absorption Rate) values, and evaluated compliance with international exposure limits (ICNIRP guidelines). Applied numerical methods for Maxwell's equations.",
      "tags": ["MATLAB", "Numerical Analysis", "EMF", "Simulation"],
      "url": "https://github.com/FedericoSabbadini/Elettrosmog",
      "featured": false,
      "news": false
    },
    {
      "id": "gurobi",
      "title": "Gurobi Optimization",
      "period": "Jan 2023 - Jun 2023",
      "badge": "Opt",
      "badgeClass": "badge-danger",
      "description": "Solved complex combinatorial optimization problems using Gurobi solver and mathematical programming techniques. Formulated real-world scenarios as Integer Linear Programs (ILP), implemented constraint modeling for scheduling, routing, and resource allocation problems. Achieved optimal solutions for NP-hard instances through branch-and-bound and cutting plane methods.",
      "tags": ["Operations Research", "ILP", "Gurobi", "Python"],
      "url": "https://github.com/FedericoSabbadini/Gurobi_Optimization",
      "featured": false
    }
  ]
}
